#print("Все данные вводите в СИ")
km = 18 #input("Введите колличесво магистальных насосов: ")
d = 0.5 #input("Введите внутренний диаметр трубопровода: ")
k = 0.0002 #input("Введите эквивалентую шероховатость: ")
L = 10 ** 7 #input("Введите длину трубопровода: ")
v = 20 * (10 ** -6) #input("Введите вязкость жидкости: ")
dz = 0 #input("Введите разницу высотных отметок: ")
h0 = 0 #input("Введите разницу напоров в резервуарах: ")
K1 = 1.426 
K2 = 3.154 
pi = 3.14 
g = 9.81 
an = 102.4 #input("Введите характеристику подпорного насоса A: ")
bn = 3.7584E-06 #input("Введите характеристику подпорного насоса B: ")
am = 260.0 #input("Введите характеристику магистралльного насоса A: ")
bm = 8.564 / (10 ** 5) #input("Введите характеристику магистралльного насоса B: ")
mn = 1 #input("Введите подпорных магистальных насосов: ")
Ne = 0 #input("Введите колличесво эксплутационных участков: ")

A = km * am 
B = (pi * d ** 2) ** 2 * bm * km * 3600 ** 2 / 16
w1 = 10 * v / k 
C = 0.11 * k ** 0.25 * L /(2 * g * d ** 1.25)
b = 68 * v / k
e1 = A - C * (b * w1 ** 7 + w1 ** 8) ** 0.25 - B * w1 ** 2
if e1 < 0:
    w2 = 2320 * v / d 
    d2 = 0.3164 * v ** 0.25 * L / (2 * g * d ** 1.25)
    e2 = A - d2 * w2 ** 1.75- B * w2 ** 2
    if e2 < 0:
        б = 64 * v / d ** 2 * L / 2 / g
        D = б ** 2 - 4 * B * A
        w = (-б + D ** 0.5) / (2 * B)
        Ht = 64 * v / d ** 2 * L / (2 * g) * w
    else:
        б = 0.3164 * v ** 0.25 / d ** 1.25 * L / 2 / g
        β = б / B
        γ = A / B
        e3 = γ - 2 * β ** 8
        if e3 < 0:
            t1 = (γ / (β * K1)) ** (1 / 7)
            t2 = (γ / (β + t1)) ** (1 / 7)
            t3 = (γ / (β + t2)) ** (1 / 7)
            w = (γ / (β + t3)) ** (1 / 1.75)
            Ht = 0.3164 / (w * d / v) ** 0.25 * L / d * w ** 2 /(2 * g)
        else:
            t1 = (γ / K1) ** (1 / 8)
            t2 = (γ / (1 + β / t1)) ** (1 / 8)
            t3 = (γ / (1 + β / t2)) ** (1 / 8)
            w = (γ / (β + t3)) ** (1 / 1.75)
            Ht = 0.3164 / (w * d / v) ** 0.25 * L / d * w ** 2 /(2 * g)
else:
    w2 = 500 * w1
    d1 = 0.11 * 68 ** 0.25 * v ** 0.25 * L / (2 * g * d ** 1.75)
    c1 = B + 0.11 * k ** 0.25 / d ** 1.75 * L / (2 * g)
    e2 = A - d1 * w2 ** 1.75 - c1 * w2 ** 2
    if e2 < 0:
        w1 = (A / (B + C * K2 ** 0.25)) ** 0.5
        w2 = (A / (B + C * (1 + b / w1) ** 0.25)) ** 0.5
        w3 = (A / (B + C * (1 + b / w2) ** 0.25)) ** 0.5
        w = (A / (B + C * (1 + b / w3) ** 0.25)) ** 0.5
        Ht = 0.11 * (68 / (d * w / v) + k / d) ** 0.25 * L / d * w ** 2 / (2 * g)
    else: 
        w = (A / (B + 0.11 * k ** 0.25 * L / (d ^ 1.25 * 2 * g))) ** 0.5
        Ht = 0.11 * (k / d) ** 0.25 * L / d * w ** 2/ (2 * g)
Q = w * pi * d ** 2 / 4 * 3600
Hns = A - B * w ** 2
print (f"Скорость: {w}\nРасход: {Q}\nНапор насосов: {Hns}\nПотребный напор: {Ht}")
 